

class Text:

    def podpiska(self):
        return '''Ви підписані👍 

Кожного дня ми спостерігаємо за цінами на ринку та оновлюємо інформацію, щоб тримати вас в курсі вигідних пропозицій. 

*Якщо наш бот буде надокучати, ви завжди можете його зупинити - тицьнути «Відписатися від розсилки».'''

    def prise(self,data,prise):
        return f'📆Ціна станом на {data}\n\n{prise}\n\n🔎Відслідковуйте найвигідніші пропозиції на ринку України. Підписуйтесь  на розсилку, та отримуйте актуальні ціни на сільськогосподарську продукцію.'

    def otpiska(self):
        return '''Нам буде сумно без вас☹️ 

*Але є гарні новини. Ви завжди можете підписатися ще раз☺️ 
До зустрічі👋'''

    def contakt1(self):
        return 'Очікуйте на дзвінок протягом 5 хвилин'
    def contakt2(self):
        return 'Ойойой, здаеться вже пізно ... Очікуйте на наш звінок завтра з 9.00 '

    def location(self,km, prise):
        return f'''🌾Вигрузка продукту здійснюється в місті Миколаїв, порт Нікотера. 

📍Відстань від вашої локації до місця вигрузки складає {km} км.

💰Сума перевозки за 1 тону = {prise} грн.

Щоб отримати більш детальну інформацію та замовити перевезення, натисніть «Зв’язатися зі мною» і ми вам зателефонуємо😎☎️'''


    def start(self):
        return '''Перед тим як перейти до роботи, пропонуємо познайомитися🤝

🔸Хто ми? «ТОВ Алянс» 

🔹Що робимо? Пропонуємо вигідну ціну за сільськогосподарську продукцію та розраховуємо вартість перевезення.

🔸Як це працює? Ви хочете продати сг кульуру. Ми хочемо її у вас купити.
🌾Наприклад вас цікавить ячмінь. Кожного дня ми оновлюємо ціни відносно ринку. Якщо ціна за ячмінь вас задовільняє, ви тицяєте «Розрахувати доставку». Наш бот рахує відстань від вашої локації, до точки вигрузки. Ви готові оформити продаж або у вас виникли питання, натискаєте «Зв’язатися зі мною». Ми телефонуємо та обговорюємо всі деталі. Готово✅'''


    def prise_rozsilka(self,data,prise):
        return f'📆Ціна станом на {data}\n\n{prise}\n\n🔎Відслідковуйте найвигідніші пропозиції на ринку України.'
